# Дана строка. Вывести строку, содержащую те же символы, но расположенные в обратном порядке

n = input('Введите символы: ')  # ввод символов
print(n[::-1])  # вывод символов наоборот