# Дана строка. Вывести строку, содержащую те же символы, но расположенные в обратном порядке

n = input()  # ввод символов
print(n[::1])  # вывод символов наоборот
